DELETE
FROM user_role;
DELETE
FROM meals;
DELETE
FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin'),
       ('Guest', 'guest@gmail.com', 'guest');

INSERT INTO user_role (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals(user_id, date_time, description, calories)
VALUES (100000, '2024-07-29 09:00:00', 'завтрак юзер', 500),
       (100000, '2024-07-29 12:30:00', 'обед юзер', 600),
       (100000, '2024-07-29 15:00:00', 'ланч юзер', 700),
       (100000, '2024-07-29 19:40:00', 'ужин юзер', 800),
       (100000, '2024-06-20 08:00:00', 'завтрак юзер', 500),
       (100000, '2024-06-20 13:50:00', 'обед юзер', 500),
       (100000, '2024-06-20 17:00:00', 'ланч юзер', 500),
       (100000, '2024-06-20 21:10:00', 'ужин юзер', 500),
       (100001, '2024-07-29 10:35:00', 'завтрак админ', 500),
       (100001, '2024-07-29 11:30:00', 'обед админ', 600),
       (100001, '2024-07-29 16:20:00', 'ланч админ', 700),
       (100001, '2024-07-29 22:10:00', 'ужин админ', 800),
       (100001, '2024-05-10 07:34:00', 'завтрак админ', 100),
       (100001, '2024-05-10 14:29:00', 'обед админ', 500),
       (100001, '2024-05-10 18:48:00', 'ланч админ', 500),
       (100001, '2024-05-10 23:59:00', 'ужин админ', 500);

